# SSD with Mobilenet v2 configuration for MSCOCO Dataset.
# Users should configure the fine_tune_checkpoint field in the train config as
# well as the label_map_path and input_path fields in the train_input_reader and
# eval_input_reader. Search for "PATH_TO_BE_CONFIGURED" to find the fields that
# should be configured.

model {
  ssd {
    # CONFIGURED
    num_classes: 5
    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }
    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
      }
    }
    similarity_calculator {
      iou_similarity {
      }
    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.2
        max_scale: 0.95
        aspect_ratios: 1.0
        aspect_ratios: 2.0
        aspect_ratios: 0.5
        aspect_ratios: 3.0
        aspect_ratios: 0.3333
      }
    }
    image_resizer {
      # CONFIGURED
      fixed_shape_resizer {
        height: 300
        width: 400
      }
    }
    box_predictor {
      convolutional_box_predictor {
        min_depth: 0
        max_depth: 0
        num_layers_before_predictor: 0
        use_dropout: false
        dropout_keep_probability: 0.8
        kernel_size: 3
        box_code_size: 4
        apply_sigmoid_to_scores: false
        conv_hyperparams {
          activation: RELU_6,
          regularizer {
            l2_regularizer {
              weight: 0.00004
            }
          }
          initializer {
            truncated_normal_initializer {
              stddev: 0.03
              mean: 0.0
            }
          }
          batch_norm {
            train: true,
            scale: true,
            center: true,
            decay: 0.9997,
            epsilon: 0.001,
          }
        }
      }
    }
    feature_extractor {
      type: 'ssd_mobilenet_v2'
      min_depth: 16
      depth_multiplier: 1.0
      use_depthwise: true
      conv_hyperparams {
        activation: RELU_6,
        regularizer {
          l2_regularizer {
            weight: 0.00004
          }
        }
        initializer {
          truncated_normal_initializer {
            stddev: 0.03
            mean: 0.0
          }
        }
        batch_norm {
          train: true,
          scale: true,
          center: true,
          decay: 0.9997,
          epsilon: 0.001,
        }
      }
      batch_norm_trainable: true
    }
    loss {
      classification_loss {
        weighted_sigmoid {
        }
      }
      localization_loss {
        weighted_smooth_l1 {
        }
      }
      hard_example_miner {
        num_hard_examples: 3000
        iou_threshold: 0.99
        loss_type: CLASSIFICATION
        max_negatives_per_positive: 3
        min_negatives_per_image: 3
      }
      classification_weight: 1.0
      localization_weight: 1.0
    }
    normalize_loss_by_num_matches: true
    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 100
        max_total_detections: 100
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 16
  optimizer {
    rms_prop_optimizer: {
      learning_rate: {
        manual_step_learning_rate {
          initial_learning_rate: 4e-3
          schedule {
            step: 15000
            learning_rate: 4e-4
          }
          schedule {
            step: 30000
            learning_rate: 4e-5
          }
        }
      }
      momentum_optimizer_value: 0.9
      decay: 0.9
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "/home/lhoyer/cnn_robot_localization/training/first_stage_2/ssd_mobilenet2/base_model/model.ckpt"
  fine_tune_checkpoint_type:  "detection"
  # Note: The below line limits the training process to 200K steps, which we
  # empirically found to be sufficient enough to train the pets dataset. This
  # effectively bypasses the learning rate schedule (the learning rate will
  # never decay). Remove the below line to train indefinitely.
  num_steps: 25000 

  # CONFIGURED
  keep_checkpoint_every_n_hours: 1


  #IMPORTANT: Consider that custom tf record data as the orientation isn't updated!
  data_augmentation_options {
    random_horizontal_flip {
    }
  }
  data_augmentation_options {
    random_vertical_flip {
    }
  }
  data_augmentation_options {
    ssd_random_crop {
    }
  }
}

train_input_reader: {
  tf_record_input_reader {
    # CONFIGURED
    input_path: "/home/lhoyer/cnn_robot_localization/data/dataset2/exp4/crop_method_both_400x300.record"
  }
  # CONFIGURED
  label_map_path: "/home/lhoyer/cnn_robot_localization/CNNRobotLocalisation/LabelMaps/robot_label_map.pbtxt"
}

eval_config: {
  # CONFIGURED
  # 3 * 1600
  num_examples: 4800
  num_visualizations: 0
  # Every 20 min
  eval_interval_secs: 1200
  metrics_set: ["pascal_voc_detection_metrics","coco_detection_metrics"]
}

eval_input_reader: {
  tf_record_input_reader {
    # CONFIGURED
    input_path: ["/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_by_al_copter_led_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_by_nl_copter_led_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_by_al_copter_letter_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_by_nl_copter_letter_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_by_nl_sphero_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_bg_al_sphero_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_bg_nl_sphero_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_bg_al_youbot_mp1_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_bg_al_youbot_mp2_400x300.record","/home/lhoyer/cnn_robot_localization/data//Validation/1400PerTypeDistr3/eval_bg_nl_youbot_mp2_400x300.record"]
  }
  # CONFIGURED
  label_map_path: "/home/lhoyer/cnn_robot_localization/CNNRobotLocalisation/LabelMaps/robot_label_map.pbtxt"
  shuffle: false
  num_readers: 1
}
